Revit 2024 API
BuiltInFailures.ConnectorFailures.UndefinedConnector Property
 Revit does not support Undefined connectors. The following have been replaced by the default connector: [Connector Element]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UndefinedConnector { get; }
Visual Basic
Public Shared ReadOnly Property UndefinedConnector As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UndefinedConnector {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace